faris1702/SC2079-STM32-Robot/main.c
}

void Motor_reverseA(int  pwmVal){
	 // move robot forward send the values to serial port for display
	 Motor_directionA(0); //reverse
	 __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pwmVal); // output PWM waveform to drive motor A

}

//--------------------------------------------------------------------------------
void MotorStopB(void){
	__HAL_TIM_SetCompare(&htim9, TIM_CHANNEL_1, 0);
	__HAL_TIM_SetCompare(&htim9, TIM_CHANNEL_2, 0);
}

void Motor_directionB(uint8_t forward) {
	if (forward){// move forward
		__HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,0); // set IN1 to maximum PWM (7199) for '1'
	  }
	else { // reverse
		__HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,0); // set IN2 to maximum PWM (7199) for '1'
	}
}

void Motor_forwardB(int  pwmVal){
	 // rotate motor in clockwise forward send the values to serial port for display
	 Motor_directionB(1); //forward
	 __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pwmVal); // output PWM waveform to drive motor A

}

void Motor_reverseB(int  pwmVal){
	 // move robot forward send the values to serial port for display
	 Motor_directionB(0); //reverse
	 __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pwmVal); // output PWM waveform to drive motor A

}
//--------------------------------------------------------------------------------
void MotorStop_both(void){
	__HAL_TIM_SetCompare(&htim9, TIM_CHANNEL_1, 0);
	__HAL_TIM_SetCompare(&htim9, TIM_CHANNEL_2, 0);
	__HAL_TIM_SetCompare(&htim4, TIM_CHANNEL_3, 0);
	__HAL_TIM_SetCompare(&htim4, TIM_CHANNEL_4, 0);
}

void Motor_direction_both(uint8_t forward) {
	if (forward){// move forward
		__HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,0); // set IN1 to maximum PWM (7199) for '1'
		__HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,0);
	  }
	else { // reverse
		__HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,0); // set IN2 to maximum PWM (7199) for '1'
		__HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,0);
	}
}

void Motor_forward_both(int  pwmVal){
	 // rotate motor in clockwise forward send the values to serial port for display
	 Motor_direction_both(1); //forward
	 __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pwmVal); // output PWM waveform to drive motor A
	 __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pwmVal);
}

void Motor_reverse_both(int  pwmVal){
	 // move robot forward send the values to serial port for display
	 Motor_direction_both(0); //reverse
	 __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pwmVal); // output PWM waveform to drive motor A
	 __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pwmVal);
}

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


//-------- IR sensor ----------
float ir_dist_left = 0;
float ir_dist_right = 0;
float ir_dist_left_prev = 0.0f;
float ir_dist_right_prev = 0.0f;
float ir_dist_left_lpf = 0.0f;
float ir_dist_right_lpf = 0.0f;
uint16_t ir_raw_left = 0;
uint16_t ir_raw_right = 0;
int ir_dist_right_int = 0;
int ir_dist_left_int = 0;
//----------------------------


//------ Gyrometer ------
int16_t gyro_z_raw = 0;
float gyro_z_dps = 0.0f;
int gyro_z_dps_int = 0;
float gyro_z_dps_prev = 0.0f;
float angle_direction = 0.0f;
int angle_direction_int = 0;
float prev_angle_direction = 0.0f;

float angle_direction_hpf = 0.0f;
float angle_direction_hpf_prev = 0.0f;
int angle_direction_hpf_int = 0;
//-----------------------

//--- Ultrasonic Sensor ---
int us_echo = 0;
float us_dist = 0.0f;
int tc1 = 0;
int tc2 = 0;
float us_dist_prev = 0.0f;
float us_dist_lpf = 0.0f;
int us_dist_int = 0;
//--------------------------


//------- Motor ------------
int motor_left_encoder = 0;
int motor_right_encoder = 0;
int prev_left_encoder = 0;
int prev_right_encoder = 0;

float motor_left_encoder_lpf = 0;
float motor_right_encoder_lpf = 0;
float motor_left_encoder_lpf_prev = 0;
float motor_right_encoder_lpf_prev = 0;

uint32_t total_left_encoder = 0;
uint32_t total_right_encoder = 0;
int distance_travelled_int = 0;
float distance_travelled = 0.0f;
float total_revolution = 0.0f;
int total_revolution_int = 0;
int total_encoder = 0;

float motor_left_rpm = 0.0f;
float motor_right_rpm = 0.0f;
int motor_left_rpm_int = 0;
int motor_right_rpm_int = 0;

float motor_left_rpm_lpf = 0.0f;
float motor_right_rpm_lpf = 0.0f;
int motor_left_rpm_lpf_int = 0;
int motor_right_rpm_lpf_int = 0;

int encoder_difference = 0;
//--------------------------------

//-------- UART ------------
uint8_t aRxBuffer[20];
//--------------------------

//------------ PID Controller ----------
#define OUTPUT_MIN_MOTOR -2500
#define OUTPUT_MAX_MOTOR 2500
#define OUTPUT_MAX_PWM_MOTOR 2500
#define OUTPUT_MIN_PWM_MOTOR 0
#define INTEGRAL_MAX_MOTOR 200

#define OUTPUT_MIN_ANGLE -2500
#define OUTPUT_MAX_ANGLE 2500
#define OUTPUT_MAX_PWM_ANGLE 2500
#define OUTPUT_MIN_PWM_ANGLE0
#define INTEGRAL_MAX_ANGLE 200

typedef struct {
	float Kp;
	float Ki;
	float Kd;
	int prevError;
	int integral;
	int pid_change;
	int pwm_output;
} PID_Controller;

void setPID(PID_Controller *pid, float Kp, float Ki, float Kd, int pwm_output){
	pid->Kp = Kp;
	pid->Ki = Ki;
	pid->Kd = Kd;
	pid->pwm_output = pwm_output;
}
PID_Controller pid_left, pid_right, pid_angle;

//--------------------------------------

//---------------- Miscellaneous --------------------
#define SERVO_LEFT 47
#define SERVO_MIDDLE 74
#define SERVO_RIGHT 115
#define LEFT 1
#define RIGHT 0
#define FORWARD 1
#define REVERSE 0

int error_left_encoder = 0, error_right_encoder = 0;
float error_left_rpm = 0.0f, error_right_rpm = 0.0f;
float deadband_left = 250.0f, deadband_right = 250.0f;
int pwm_left = 0, pwm_right = 0;
float error_angle = 0.0f;
int error_angle_int = 0;
//----------------------------------------------------

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

