faris1702/SC2079-STM32-Robot/main.c
void read_mag_z(int16_t *mag_z_out)
{
    uint8_t st1, st2, reg, buf[2];
    char buf1[20];

    // 1) Wait for data-ready (ST1 bit0 = 1)
    reg = 0x10;
    HAL_I2C_Master_Transmit(&hi2c2, 0x0C<<1, &reg, 1, 1000);
    HAL_I2C_Master_Receive(&hi2c2, 0x0C<<1, &st1, 1, 1000);
    if ((st1 & 0x01) == 0) { // no new data
        OLED_ShowString(80, 5, "err");
    }

    // 2) Read Z low/high (0x15, 0x16)
    reg = 0x15; // HZL
    HAL_I2C_Master_Transmit(&hi2c2, 0x0C<<1, &reg, 1, 1000);
    HAL_I2C_Master_Receive(&hi2c2, 0x0C<<1, buf, 2, 1000);
    int16_t mag_z = (int16_t)((buf[1] << 8) | buf[0]); // little-endian

    // 3) Read ST2 (0x18) to complete the read sequence
    reg = 0x18;
    HAL_I2C_Master_Transmit(&hi2c2, 0x0C<<1, &reg, 1, 1000);
    HAL_I2C_Master_Receive(&hi2c2, 0x0C<<1, &st2, 1, 1000);

    *mag_z_out = mag_z;
//    sprintf(buf1, "%5d", mag_z);
//    OLED_ShowString(5, 15, buf1);
}


void PID_Compute(PID_Controller *pid, float error, float dt)
{
	// Integral term with anti-windup
	pid->integral += error * dt;
	if (pid->integral > INTEGRAL_MAX_MOTOR) pid->integral = INTEGRAL_MAX_MOTOR;
	if (pid->integral < -INTEGRAL_MAX_MOTOR) pid->integral = -INTEGRAL_MAX_MOTOR;

	// Derivative term
	float derivative = (error - pid->prevError) / dt;

	// PID output
	float output = pid->Kp * error
				 + pid->Ki * pid->integral
				 + pid->Kd * derivative;

	// Clamp to output range
	if (output > OUTPUT_MAX_MOTOR) output = OUTPUT_MAX_MOTOR;
	if (output < OUTPUT_MIN_MOTOR) output = OUTPUT_MIN_MOTOR;

	pid->pid_change = output;
	pid->prevError = error;
	pid->pwm_output += (int)output;
	if (pid->pwm_output > OUTPUT_MAX_MOTOR) pid->pwm_output = OUTPUT_MAX_MOTOR;
	if (pid->pwm_output < 0) pid->pwm_output = 0;

}

void PID_Angle(PID_Controller *pid, float error, float dt){
	// Integral term with anti-windup
	pid->integral += error * dt;
	if (pid->integral > INTEGRAL_MAX_ANGLE) pid->integral = INTEGRAL_MAX_ANGLE;
	if (pid->integral < -INTEGRAL_MAX_ANGLE) pid->integral = -INTEGRAL_MAX_ANGLE;

	// Derivative term
	float derivative = (error - pid->prevError) / dt;

	// PID output
	float output = pid->Kp * error
				 + pid->Ki * pid->integral
				 + pid->Kd * derivative;

	// Clamp to output range
	if (output > OUTPUT_MAX_ANGLE) output = OUTPUT_MAX_ANGLE;
	if (output < OUTPUT_MIN_ANGLE) output = OUTPUT_MIN_ANGLE;

	pid->pid_change = output;
	pid->prevError = error;
	pid->pwm_output = (int)output;
	if (pid->pwm_output > OUTPUT_MAX_ANGLE) pid->pwm_output = OUTPUT_MAX_ANGLE;
	if (pid->pwm_output < 0) pid->pwm_output = 0;
}



void forward(float target_rpm, float target_distance, int delay){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	for (;;){
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------- End of Distance Calculation ------------------


		//-------------------- Check distance travelled ------------------
		  if ((distance_travelled >= target_distance) && (target_distance != 0.0f)){
			  MotorStop_both();
			  break;
		  }
		//-----------------------------------------------------------------

		  osDelay(delay);
	}
}

void reverse(float target_rpm, float target_distance, int delay){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(0);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0;

	for (;;){
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------- End of Distance Calculation ------------------


		//-------------------- Check distance travelled ------------------
		  if ((distance_travelled >= target_distance) && (target_distance != 0.0f)){
			  MotorStop_both();
			  break;
		  }
		//-----------------------------------------------------------------

		  osDelay(delay);
	}
}

void forwardTurn(int dir, float target_angle, float target_rpm, int delay){
	//-------------------- Servo Init -----------------------
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	if (dir == LEFT) htim12.Instance->CCR1 = SERVO_LEFT;
	else 		  htim12.Instance->CCR1 = SERVO_RIGHT;
	//--------------------------------------------------------

	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	osDelay(500);
	prev_angle_direction = 0.0f;
	angle_direction = 0.0f;


