faris1702/SC2079-STM32-Robot/main.c
	for (;;){
		//------------- Turning motion -------------------------
		  error_angle = target_angle - fabsf(angle_direction);
		  error_angle_int = error_angle;
		//------------------------------------------------------

		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//------------------ Check angle turned --------------------------
//		  if (error_angle <= 15.0f){
//			  target_rpm = 30.0f;
//		  }

		  if ((error_angle) <= 0.2f){
			  MotorStop_both();
			  osDelay(500);
			  htim12.Instance->CCR1 = SERVO_MIDDLE;
			  break;
		  }
		//----------------------------------------------------------------

		  osDelay(delay);
	}

}

void reverseTurn(int dir, float target_angle, float target_rpm, int delay){
	//-------------------- Servo Init -----------------------
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	if (dir == LEFT) htim12.Instance->CCR1 = SERVO_LEFT;
	else 		  htim12.Instance->CCR1 = SERVO_RIGHT;
	//--------------------------------------------------------

	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(0);
	//--------------------------------------------------------

	osDelay(500);
	prev_angle_direction = 0.0f;
	angle_direction = 0.0f;

	for (;;){
		//------------- Turning motion -------------------------
		  error_angle = target_angle - fabsf(angle_direction);
		  error_angle_int = error_angle;
		//------------------------------------------------------

		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//------------------ Check angle turned --------------------------
//		  if (error_angle <= 15.0f){
//			  target_rpm = 30.0f;
//		  }

		  if ((error_angle) <= 0.2f){
			  MotorStop_both();
			  osDelay(500);
			  htim12.Instance->CCR1 = SERVO_MIDDLE;
			  break;
		  }
		//----------------------------------------------------------------

		  osDelay(delay);
	}

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  for(;;)
  {

	// Toggle LED every 1s to show that STM not stuck in loop and still running
	HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin);
	osDelay(1000);

	// Buzzer turns on/off when USER button pressed
	if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == RESET){
		HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_8);

	}
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_show */
/**
* @brief Function implementing the ShowTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_show */
void show(void *argument)
{
  /* USER CODE BEGIN show */
	char buffer[20];

  /* Infinite loop */
  for(;;)
  {
	  sprintf(buffer, "Motor L:%2d R:%2d", motor_left_rpm_int, motor_right_rpm_int);
	  OLED_ShowString(5, 5, buffer);

	  sprintf(buffer, "Dist:%4d", distance_travelled_int);
	  OLED_ShowString(5, 15, buffer);

	  sprintf(buffer, "IR L:%2d R:%2d", ir_dist_left_int, ir_dist_right_int);
	  OLED_ShowString(5, 25, buffer);

	  sprintf(buffer, "US:%3d", us_dist_int);
	  OLED_ShowString(5, 35, buffer);

//	  sprintf(buffer, "Angle:%3d", gyro_z_dps_int);
	  sprintf(buffer, "%04d-\0", encoder_difference);
	  OLED_ShowString(5, 45, buffer);

	// ------- Print UART message ----------
//	sprintf(buffer, "%s\0", aRxBuffer);
//	OLED_ShowString(5, 45, buffer);
	// ----- End Print UART message --------




	// Refreshes the OLED screen every 0.5s
	// This is the only refresh function call in all the tasks
	OLED_Refresh_Gram();

    osDelay(500);
  }
  /* USER CODE END show */
}

/* USER CODE BEGIN Header_motors */
/**
* @brief Function implementing the MotorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_motors */
void motors(void *argument)
{
  /* USER CODE BEGIN motors */
//	pid_left.Kp = 2.0f;
//	pid_left.Ki = 0.0f;
//	pid_left.Kd = 0.0f;
//	pid_left.pwm_output = 0;
//
//	pid_right.Kp = 2.0f;
//	pid_right.Ki = 0.0f;
//	pid_right.Kd = 0.0f;
//	pid_right.pwm_output = 0;


//	int delay = 40;
//
//	float target_rpm_left = 60.1f;
//	float target_rpm_right = 60.0f;
//	float target_rpm = 60.0f;
//	float dt = delay/1000.0f;
//
//	int flag = 0;
//	int left_flag = 0;
//	int right_flag = 0;


	//90 -> 79.25
	//180 -> 158.5
	//270 -> 237.75
	//360 -> 317
//	float target_angle = 317.0f;

//	__HAL_TIM_SET_COUNTER(&htim2, 0);
//	__HAL_TIM_SET_COUNTER(&htim3, 0);

	//*************** MOTOR START *****************
//	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
//	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
//	MotorDrive_enable();
//	__HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,0);  //Motor B (left)
//	__HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,0);  //Motor A (right)
	//*********************************************

