faris1702/SC2079-STM32-Robot/main.c
	//-------------------------- Servo Init -----------------------------
//	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
//	htim12.Instance->CCR1 = SERVO_MIDDLE; //middle
	//--------------------------------------------------------------------


	osDelay(5000);  //starting buffer
	forward(60.0f, 100.0f, 40);
	osDelay(1000);
	forward(60.0f, 100.0f, 40);
	osDelay(1000);
	reverse(60.0f, 100.0f, 40);
//	forwardTurn(RIGHT, 90.0f, 60.0f, 40);
//	osDelay(2000);
//	reverseTurn(LEFT, 90.0f, 60.0f, 40);

	//-------------- Servo Init 2 ------------------
//	htim12.Instance->CCR1 = SERVO_LEFT; //left
//	osDelay(1000);
	//----------------------------------------------

//	angle_direction = 0.0f;

  /* Infinite loop */
  for(;;)
  {
	  //***** Un-comment to stop *****
	  osDelay(1000);
	  continue;
	  //*****************************

//	  if (flag) continue;

	//------------- Turning motion -------------------------
//	  error_angle = target_angle - angle_direction;
//	  error_angle_int = error_angle;
	//------------------------------------------------------

    //--------------- PID Controller -------------------------
//	  forward(&pid_left, &pid_right, target_rpm_left, target_rpm_right, dt);
//	  error_left_rpm = (target_rpm_left) - motor_left_rpm;
//	  error_right_rpm = (target_rpm_right) - motor_right_rpm;
//
//	  PID_Compute(&pid_left, error_left_rpm, dt);
//	  PID_Compute(&pid_right, error_right_rpm, dt);
//
//	  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
//	  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
	//-------------------------------------------------------------

	  //---------------------- Drift Correction ---------------------------------
//	  if (right_flag){
//		  right_flag++;
//		  if (right_flag >= 25){
//			  target_rpm_right = target_rpm;
//			  right_flag = 0;
//		  }
//	  }
//
//	  if (left_flag){
//		  left_flag++;
//		  if (left_flag >= 25){
//			  target_rpm_left = target_rpm;
//			  left_flag = 0;
//		  }
//	  }
//
//	  if (encoder_difference > 50 && !right_flag){
//		  target_rpm_right += 1.0f;
//		  right_flag = 1;
//	  }
//
//	  else if (encoder_difference < -50 && !left_flag){
//		  target_rpm_left += 1.0f;
//		  left_flag = 1;
//	  }
	  //------------------------------------------------------------------------------



	//-------------- Distance Calculation ----------------------
//	  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
//	  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,
//
//	  total_revolution_int = total_revolution;
//	  distance_travelled_int = distance_travelled;
	//----------- End of Distance Calculation ------------------


	//-------------------- Check distance travelled ------------------
//	  if ((distance_travelled >= 80.0f)){
//		  MotorStop_both();
//		  flag = 1;
//		  osDelay(500);
//		  htim12.Instance->CCR1 = SERVO_MIDDLE;
//	  }
	//-----------------------------------------------------------------

	//------------------ Check angle turned --------------------------
//	  if ((error_angle) <= 0.2f){
//		  MotorStop_both();
//		  flag = 1;
//		  osDelay(500);
//		  htim12.Instance->CCR1 = SERVO_MIDDLE;
//	  }
	//----------------------------------------------------------------

//	osDelay(delay);
  }
  /* USER CODE END motors */
}

/* USER CODE BEGIN Header_encoder */
/**
* @brief Function implementing the EncoderTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder */
void encoder(void *argument)
{
  /* USER CODE BEGIN encoder */
  /* Infinite loop */
  // --------------- Right Motor (Motor A) --------------------------
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

  int cnt1A, cnt2A;
  uint32_t tickA;

  cnt1A = __HAL_TIM_GET_COUNTER(&htim2);
  tickA = HAL_GetTick();
  uint8_t display1[20];
  uint8_t display2[20];
  uint16_t dirA;
  float a = 0.95f;

  for(;;)
  {
    if (HAL_GetTick() - tickA > 40L){
    	cnt2A = __HAL_TIM_GET_COUNTER(&htim2);
    	if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2)){
    		if (cnt2A < cnt1A)
    			motor_right_encoder = cnt1A - cnt2A;
    		else
    			motor_right_encoder = (65535 - cnt2A) + cnt1A;
    	}
    	else{
    		if (cnt2A > cnt1A)
    			motor_right_encoder = cnt2A - cnt1A;
    		else
    			motor_right_encoder = (65535 - cnt1A) + cnt2A;
    	}

    	//----------------------- without LPF -----------------------
//    	if (motor_right_encoder > 250) motor_right_encoder = 0;
//    	total_right_encoder += motor_right_encoder;
//		motor_right_encoder *= 20;
//		motor_right_rpm = motor_right_encoder / 22.0f; // 60/1320 = 1/22
    	//-----------------------------------------------------------

    	//------------------------------- with LPF ---------------------------------------
    	if (motor_right_encoder > 250){
    		motor_right_encoder = 0;
    		motor_right_encoder_lpf = 0;
    	}
    	total_right_encoder += motor_right_encoder;
    	motor_right_encoder *= 25;
//    	total_right_encoder = __HAL_TIM_GET_COUNTER(&htim2);
    	motor_right_rpm = motor_right_encoder / 22.0f; // 60/1320 = 1/22

    	motor_right_encoder_lpf = (motor_right_encoder * (1-a)) + (prev_right_encoder * a);
    	prev_right_encoder = motor_right_encoder_lpf;  // for LPF
    	motor_right_rpm_lpf = motor_right_encoder_lpf / 22.0f; // 60/1320 = 1/22
    	motor_right_rpm_lpf_int = motor_right_rpm_lpf;
    	//---------------------------------------------------------------------------------


    	motor_right_rpm_int = motor_right_rpm;
    	dirA = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2);

    	//-------------------- OLED Display --------------------------
//    	sprintf(display1, "(R)S:%3d.%2d",motor_right_rpm_int, motor_right_rpm_frac);
//    	sprintf(display2, " %1d",dirA);

