faris1702/SC2079-STM32-Robot/main.c
//    	OLED_ShowString(5, 25, display1);
//    	OLED_ShowString(90, 25, display2);
    	//-------------------------------------------------------------

    	//---------- Reset Procedure ------------
    	cnt1A = __HAL_TIM_GET_COUNTER(&htim2);
	    tickA = HAL_GetTick();
	    //---------------------------------------
    }
//    osDelay(1);
  }
  /* USER CODE END encoder */
}

/* USER CODE BEGIN Header_servo */
/**
* @brief Function implementing the ServoTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_servo */
void servo(void *argument)
{
  /* USER CODE BEGIN servo */
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);

//	osDelay(1500);
//    htim12.Instance->CCR1 = SERVO_MIDDLE; //middle
//    osDelay(1500);
//	htim12.Instance->CCR1 = SERVO_LEFT; //middle
//    htim12.Instance->CCR1 = SERVO_RIGHT; //right

  /* Infinite loop */
  for(;;)
  {
//    htim12.Instance->CCR1 = 74; //middle
//    osDelay(1500);
//    htim12.Instance->CCR1 = 115; //right
//	osDelay(1500);
//    htim12.Instance->CCR1 = 75; //middle
//	osDelay(1500);
//	htim12.Instance->CCR1 = 45; //left
//	osDelay(1500);
	  osDelay(1000);

  }
  /* USER CODE END servo */
}

/* USER CODE BEGIN Header_encoder_B */
/**
* @brief Function implementing the EncoderBTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder_B */
void encoder_B(void *argument)
{
  /* USER CODE BEGIN encoder_B */
	// --------------- Left Motor (Motor B) --------------------------
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);

	int cnt1A, cnt2A;
	uint32_t tickA;

	cnt1A = __HAL_TIM_GET_COUNTER(&htim3);
	tickA = HAL_GetTick();
	uint8_t display1[20];
	uint8_t display2[20];
	uint16_t dirA;
	float a = 0.95f;

	char sbuf[64];

	for(;;)
	{
	if (HAL_GetTick() - tickA > 40L){
		cnt2A = __HAL_TIM_GET_COUNTER(&htim3);
		if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim3)){
			if (cnt2A < cnt1A)
				motor_left_encoder = cnt1A - cnt2A;
			else
				motor_left_encoder = (65535 - cnt2A) + cnt1A;
		}
		else{
			if (cnt2A > cnt1A)
				motor_left_encoder = cnt2A - cnt1A;
			else
				motor_left_encoder = (65535 - cnt1A) + cnt2A;
		}


		//------------------- without LPF -------------------------
//		if (motor_left_encoder > 250) motor_left_encoder = 0;
//		total_left_encoder += motor_left_encoder;
//		motor_left_encoder *= 20;
//		motor_left_rpm = motor_left_encoder / 22.0f;  //  60/1320 = 1/22
		//---------------------------------------------------------

		//---------------------- with LPF --------------------------
		if (motor_left_encoder > 250){
			motor_left_encoder = 0;
			motor_left_encoder_lpf = 0;
		}
		total_left_encoder += motor_left_encoder;
		motor_left_encoder *= 25;
//		total_left_encoder = __HAL_TIM_GET_COUNTER(&htim3);
		motor_left_rpm = motor_left_encoder / 22.0f;  //  60/1320 = 1/22

		motor_left_encoder_lpf = (motor_left_encoder * (1-a)) + (prev_left_encoder * a);  //for LPF
		prev_left_encoder = motor_left_encoder_lpf;  //for LPF
		motor_left_rpm_lpf = motor_left_encoder_lpf / 22.0f;  //  60/1320 = 1/22
		motor_left_rpm_lpf_int = motor_left_rpm_lpf;
		//-----------------------------------------------------------


		motor_left_rpm_int = motor_left_rpm;
		dirA = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim3);
		dirA = !(dirA);

		//------------------- OLED Display ----------------
//		sprintf(display1, "(L)S:%3d.%2d",motor_left_rpm_int, motor_left_rpm_frac);
//		sprintf(display2, " %1d",dirA);

//		OLED_ShowString(5, 35, display1);
//		OLED_ShowString(90, 35, display2);
		//-------------------------------------------------


		//------------ Reset Procedure -------------
		cnt1A = __HAL_TIM_GET_COUNTER(&htim3);
		tickA = HAL_GetTick();
		//------------------------------------------

		}
//	osDelay(1);
	}
  /* USER CODE END encoder_B */
}

/* USER CODE BEGIN Header_ultra_sensor */
/**
* @brief Function implementing the UltrasonicSenso thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_ultra_sensor */
void ultra_sensor(void *argument)
{
  /* USER CODE BEGIN ultra_sensor */
	char buf[20];
  /* Infinite loop */
  for(;;)
  {
	  HAL_GPIO_WritePin(TRIG_Port, TRIG_Pin, GPIO_PIN_RESET);
	  osDelay(50);

	  //Output 1us of Trig
	  HAL_GPIO_WritePin(TRIG_Port, TRIG_Pin, GPIO_PIN_SET);
	  delay_us(10);
	  HAL_GPIO_WritePin(TRIG_Port, TRIG_Pin, GPIO_PIN_RESET);
	  osDelay(50);

	  //wait for rising edge
	  HAL_TIM_IC_Start_IT(&htim8, TIM_CHANNEL_2);
	  HAL_TIM_IC_CaptureCallback(&htim8);


	  us_dist = us_echo * 0.01715;
	  if (us_dist > 400.0f) us_dist = 400.0f;
	  if (us_dist < 0.0f) us_dist = 0.0f;
	  us_dist_int = us_dist;


	  //Low pass filter
//	  us_dist_lpf = (us_dist * 0.3) + (us_dist_prev * 0.7);
//	  us_dist_prev = us_dist_lpf;
//	  us_dist_int = us_dist_lpf;



//	  sprintf(buf, "Dis:%3dcm", us_dist_int);
//	  OLED_ShowString(10,48, buf);

  }
  /* USER CODE END ultra_sensor */
}

/* USER CODE BEGIN Header_sensor_reading */
/**
* @brief Function implementing the sensorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_sensor_reading */
void sensor_reading(void *argument)
{
  /* USER CODE BEGIN sensor_reading */
	uint8_t reg_addr = 0x37;    // start from GYRO_ZOUT_H
	uint8_t rawData[2];         // to store MSB and LSB
	float B = 0.9f;
	uint32_t tick1, tick2;

	int16_t drift_raw, drift_total=0;
	float drift_degrees;

	int delay = 10;
	float dt = delay/1000.0f;
	double offset = 0;
	double trash = 0;
	int i = 0;

	icm20948_init();
	osDelay(100); //delay to make sure ICM 20948 power up

//	tick1 = HAL_GetTick();
//
//	while (i < 1000){
//		osDelay(1);
//		HAL_I2C_Master_Transmit(&hi2c2, 0x68 << 1, &reg_addr, 1, 1000);
//		HAL_I2C_Master_Receive(&hi2c2, 0x68 << 1, rawData, 2, 1000);
//		drift_raw = (int16_t)((rawData[0] << 8) | rawData[1]);
//		trash += (double) ((double)drift_raw) * ((HAL_GetTick() - tick1)/16400.0f);
//		offset += drift_raw;
//		tick1 = HAL_GetTick();
//		i++;
//	}
//	offset = offset/i;
//
//
//	tick1 = HAL_GetTick();
  /* Infinite loop */
  for(;;)
  {
	//------------------- Gyroscope Readings ---------------------------------------
	// Step 1: Tell sensor which register to read
	if(HAL_I2C_Master_Transmit(&hi2c2, 0x68 << 1, &reg_addr, 1, 1000)!= HAL_OK){
		OLED_ShowString(5, 5, "0");
	}

	// Step 2: Read 2 bytes (MSB + LSB)
	if (HAL_I2C_Master_Receive(&hi2c2, 0x68 << 1, rawData, 2, 1000)!=HAL_OK){
		OLED_ShowString(5, 5, "1");
	}
	// Combine into signed 16-bit value
	gyro_z_raw = (int16_t)((rawData[0] << 8) | rawData[1]);
//	angle_direction += (double) ((double)gyro_z_raw - offset) * ((HAL_GetTick() - tick1)/16400.0f);
//	angle_direction_int = angle_direction;
//	tick1 = HAL_GetTick();
//	if (gyro_z_raw < 150 && gyro_z_raw > 0) gyro_z_raw = 0;
	gyro_z_dps = gyro_z_raw / 131.0f;
	gyro_z_dps_int = gyro_z_dps;
	// -----------------------------------------------------------------------------


	//-------------------- Angle Calculation -----------------------
	angle_direction = prev_angle_direction + (gyro_z_dps * dt);
	prev_angle_direction = angle_direction;
	angle_direction_int = angle_direction;
	//--------------------------------------------------------------

	//------------------- High-Pass Filter -------------------------
//	angle_direction_hpf = (B * angle_direction_hpf_prev) + (B * (gyro_z_dps - gyro_z_dps_prev));
//	angle_direction_hpf_prev = angle_direction_hpf;
//	angle_direction_hpf_int = angle_direction_hpf;
	//--------------------------------------------------------------


	osDelay(delay);
  }
  /* USER CODE END sensor_reading */
}

/* USER CODE BEGIN Header_ir_dist */
/**
* @brief Function implementing the IRDistTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_ir_dist */
void ir_dist(void *argument)
{
  /* USER CODE BEGIN ir_dist */

