faris1702/SC2079-STM32-Robot/main.c
  /* Infinite loop */
  for(;;)
  {
	// ---------------- IR Sensor Left Readings ------------------------
	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 20);
	ir_raw_left = HAL_ADC_GetValue(&hadc1);
	HAL_ADC_Stop(&hadc1);

	//  40483.4058f / (raw + 50.8020f) - 4.6692f;
	ir_dist_left = (40483.4058f / (ir_raw_left + 50.8020f)) - 4.6692f;
	if (ir_dist_left > 40.0f) ir_dist_left = 40.0;
	if (ir_dist_left < 0.0f) ir_dist_left = 0.0f;
	ir_dist_left_int = ir_dist_left;

	// Low-pass Filter
//	ir_dist_left_lpf = (ir_dist_left * 0.3f) + (ir_dist_left_prev * 0.7f);
//	ir_dist_left_prev = ir_dist_left_lpf;
//	ir_dist_left_int = ir_dist_left_lpf;

	// -------------------------------------------------------------------

	// ------------------ IR Sensor Right Readings  -----------------------
	HAL_ADC_Start(&hadc2);
	HAL_ADC_PollForConversion(&hadc2, 20);
	ir_raw_right = HAL_ADC_GetValue(&hadc2);
	HAL_ADC_Stop(&hadc2);


	// 44430.9618f / (raw + 109.84988f) - 5.72134f;
	ir_dist_right = (44430.9618f / (ir_raw_right + 109.84988f)) - 5.72134f;
	if (ir_dist_right > 40.0f) ir_dist_right = 40.0;
 	if (ir_dist_right < 0.0f) ir_dist_right = 0.0f;
	ir_dist_right_int = ir_dist_right;

	//Low-pass filter
//	ir_dist_right_lpf = (ir_dist_right * 0.3f) + (ir_dist_right_prev * 0.7f);
//	ir_dist_right_prev = ir_dist_right_lpf;
//	ir_dist_right_int = ir_dist_right_lpf;
	// --------------------------------------------------------------------

    osDelay(200);
  }
  /* USER CODE END ir_dist */
}

/* USER CODE BEGIN Header_transmit */
/**
* @brief Function implementing the transmitTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_transmit */
void transmit(void *argument)
{
  /* USER CODE BEGIN transmit */
//  uint8_t ch = 'A';
  char sbuf[64];
  int target_rpm = 60;

  /* Infinite loop */
  for(;;)
  {

	  //--------------------------------------------- Motor ------------------------------------------
//	  sprintf(sbuf, "%2d,%2d,%3d,%3d,%2d,%7d,0\r\n", motor_left_rpm_int, motor_right_rpm_int,
//			  	  	  	  	  	  	  	  	  motor_left_rpm_lpf_int, motor_right_rpm_lpf_int, target_rpm,
//											  encoder_difference);

	  sprintf(sbuf, "%5d,100\r\n", distance_travelled_int);

//	  sprintf(sbuf, "%2d,%2d,%3d,%3d,%2d,%4d,%4d,0\r\n", motor_left_rpm_int, motor_right_rpm_int,
//			  	  	  	  	  	  	  	  	  (int)error_left_rpm, (int)error_right_rpm, target_rpm,
//	  	  	  	  	  	  	  	  	  	  	  pid_left.pwm_output, pid_right.pwm_output);
	  //-----------------------------------------------------------------------------------------------

	  //------------------------------- Turning Motion ----------------------------------------------
//	  sprintf(sbuf, "%2d,%3d\r\n", error_angle, angle_direction_hpf_int);
	  //---------------------------------------------------------------------------------------------

	  //----------------------------- IR Distance --------------------------------------
//	  sprintf(sbuf, "%5d,%5d,%3d\r\n", ir_dist_left_int, ir_dist_right_int, us_dist_int);
	  //--------------------------------------------------------------------------------

	  //------------------------------ Gyroscope readings -------------------------------------
//	  sprintf(sbuf, "%5d,%3d,%3d,%3d,90\r\n", gyro_z_raw, gyro_z_dps_int, angle_direction_int, error_angle_int);
	  //---------------------------------------------------------------------------------------

	  HAL_UART_Transmit(&huart3, sbuf, strlen(sbuf), 0xFFFF);

//	HAL_UART_Transmit(&huart3, (uint8_t *)&ch, 1, 0xFFFF);
//	if (ch < 'Z') ch++;
//	else ch = 'A';

    osDelay(40);
  }
  /* USER CODE END transmit */
}

/* USER CODE BEGIN Header_encoder_diff */
/**
* @brief Function implementing the encoderDiffTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder_diff */
void encoder_diff(void *argument)
{
  /* USER CODE BEGIN encoder_diff */
	int left, right;
  /* Infinite loop */
  for(;;)
  {
    left = 65535 - __HAL_TIM_GET_COUNTER(&htim3);
	right = __HAL_TIM_GET_COUNTER(&htim2);
	encoder_difference = left - right;

	osDelay(20);
  }
  /* USER CODE END encoder_diff */
}

/* USER CODE BEGIN Header_turning_task */
/**
* @brief Function implementing the turningTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_turning_task */
void turning_task(void *argument)
{
  /* USER CODE BEGIN turning_task */
	int delay = 40;

	float target_rpm_left = 60.0f;
	float target_rpm_right = 60.0f;
	float target_angle = 90.0f;
	float dt = delay/1000.0f;

	int flag = 0;

	//-------------------------- Motor Init -----------------------------
//	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
//	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
//	MotorDrive_enable();
//	__HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,0);  //Motor B (left)
//	__HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,0);  //Motor A (right)
	//--------------------------------------------------------------------

	//-------------------------- Servo Init -----------------------------
//	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
//	htim12.Instance->CCR1 = SERVO_MIDDLE; //middle
//	osDelay(5000);
//	htim12.Instance->CCR1 = SERVO_LEFT; //left
//	osDelay(1000);
	//--------------------------------------------------------------------

	//reset value caused by vibration
//	angle_direction = 0.0f;

  /* Infinite loop */
  for(;;)
  {
	osDelay(1000);
	continue;

	if (flag) continue;

//    error_angle = target_angle - angle_direction;
//    error_angle_int = error_angle;

//    PID_Angle(&pid_angle, error_angle, dt);
//    target_rpm_left = pid_angle.pwm_output;
//    target_rpm_right = pid_angle.pwm_output;
//
//    //----------- Motor Control -------------------------
//	  error_left_rpm = (target_rpm_left) - motor_left_rpm;
//	  error_right_rpm = (target_rpm_right) - motor_right_rpm;
//
//	  PID_Compute(&pid_left, error_left_rpm, dt);
//	  PID_Compute(&pid_right, error_right_rpm, dt);
//
//	  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
//	  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
    //---------------------------------------------------


